Finite simple continued fraction ([wiki](https://en.wikipedia.org/wiki/Continued_fraction)) −− это дробь вида

a0 + 1/(a1 + 1/(a2 + 1/⋱ + 1/n)) 

Известно, что любую обыкновенную дробь можно записать в виде конечной простой непрерывной дроби.

Напишите программу, которая преобразует обыкновенную дробь в последовательность коэффициентов *a0, a1, ..., an.

Например, дроби 239/30239/30 будет соответствовать непрерывная дробь

7 + 1 / (1 + 1/29)

Cоответственно, коэффициенты будут равны 7, 1 и 29.

**Формат ввода**:

Строка, содержащая обыкновенную дробь в формате числитель/знаменатель.

**Формат вывода**:

Строка с последовательностью коэффициентов, записанных через пробел.

---

**Sample Input**:

239/30

---

**Sample Output**:

7 1 29

---

# Solution / Решение

```
a, b = input().split('/')
a, b = int(a), int(b)


def calc(a, b):
    while b > 0:
        q = a // b
        c = b
        b = a - b * q
        a = c
        yield str(q)

print(' '.join(list(calc(a, b))))
```
