Поле для игры сапёр представляет собой сетку размером *n×m*
. В ячейке сетки может находиться или отсутствовать мина. 

Напишите программу, которая выводит "решённое" поле, т.е. для каждой ячейки, не являющейся миной, указывается число мин, находящихся в соседних ячейках (учитывая диагональные направления)

**Формат ввода**:

На первой строке указываются два натуральных числа *1≤n,m≤100*
, после чего в *n* строках содержится описание поля в виде последовательности точек '.' и звёздочек '*', где точка означает пустую ячейку, а звёздочка − ячейку с миной.

**Формат вывода**:

*n* строк поля, в каждой ячейке которого будет либо число от 0 до 8, либо мина (обозначенная символом "*"), при этом число означает количество мин в соседних ячейках поля.

---

**Sample Input**:

```
4 4
..*.
**..
..*.
....
```

**Sample Output**:

```
23*1
**32
23*1
0111
```

# Solution/Решение

rows, columns = map(int, input().split())


class Field:
    def __init__(self):
        self.field = []
        for x in range(rows):
            inp = input()
            field_row = []
            for y in range(columns):
                cell = Cell(x, y, inp[y])
                field_row.append(cell)
            self.field.append(field_row)
        self.render_mines()

    def render_mines(self):
        for x in range(rows):
            for y in range(columns):
                mines_around = 0
                cell_vicinity = self.field[x][y].vicinity
                for element in cell_vicinity:
                    if self.field[element[0]][element[1]].status == '*':
                        mines_around += 1
                if self.field[x][y].status == '.':
                    self.field[x][y].status = str(mines_around)

    def __str__(self):
        res = ''
        for row in self.field:
            statuses = map(lambda x: x.status, row)
            res += ''.join(statuses) + '\n'
        return res.rstrip()


class Cell:
    def __init__(self, x, y, status):
        self.x = x
        self.y = y
        self.status = status
        self.vicinity = []
        self.mines_around = 0
        steps = range(-1, 2)
        for x in steps:
            for y in steps:
                if self.x + x >= 0 and self.x + x <= rows - 1:
                    if self.y + y >= 0 and self.y + y <= columns - 1:
                        self.vicinity.append((self.x + x, self.y + y))
        self.vicinity.remove((self.x, self.y))

    def __str__(self):
        return self.status


field = Field()
print(field)
