A durak deck contains 36 cards. Each card has a suit of either clubs, diamonds, hearts, or spades (denoted C, D, H, S). Each card also has a value of either 6 through 10, jack, queen, king, or ace (denoted 6, 7, 8, 9, 10, J, Q, K, A). For scoring purposes card values are ordered as above, with 6 having the lowest and ace the highest value.

Напишите программу, которая определяет, бьёт ли одна карта другую.
- Если встречаются две карты одной масти, то побеждает та, у которой выше значение.
- Если карты разных мастей, то карта, имеющая козырную масть, побеждает.
- Если карты разных мастей и нет козырных, то никто не побеждает.

**Формат ввода**:

На первой строке через пробел указываются две карты в формате <значение><масть>, а на следующей строке указывается козырная масть.

**Формат вывода**:

Программа должна вывести слово **First**, если первая карта бьёт вторую, **Second**, если вторая карта бьёт первую, **Error**, если ни одна из карт не может побить другую.

**Sample Input 1**:

AH JH
D

**Sample Output 1**:

First

---

**Sample Input 2**:

AH JS
S

**Sample Output 2**:

Second

---

**Sample Input 3**:

7C 10H
S

**Sample Output 3**:

Error

# Solution/Решение

```
c1, c2 = input().split()
trump = input()
suits = ('C', 'D', 'H', 'S')
values = {'6': 1,
          '7': 2,
          '8': 3,
          '9': 4,
          '10': 5,
          'J': 6,
          'Q': 7,
          'K': 8,
          'A': 9}


class Card:
    def __init__(self, c):
        self.suit = c[-1]
        self.value = values[c[:-1]]
        self.is_trump = self.suit == trump
        if self.is_trump:
            self.value += 10

    def __str__(self):
        return 'Value: {}, suit: {}, is trump: {}'.format(self.value, self.suit, self.is_trump)

card1 = Card(c1)
card2 = Card(c2)

if card1.suit == card2.suit or any((card1.is_trump, card2.is_trump)):
    if card1.value > card2.value:
        print('First')
    else:
        print('Second')
else:
    print('Error')
```

