Вам дано описание наследования классов в следующем формате. 

**имя класса 1 : имя класса 2 имя класса 3 ... имя класса k**

Это означает, что **класс 1** отнаследован от **класса 2**, **класса 3**, и т. д.

Или эквивалентно записи:

```
class Class1(Class2, Class3 ... ClassK):
    pass
```

Класс **A** является **прямым предком** класса **B**, если **B** отнаследован от **A**:

```
class B(A):
    pass
```

Класс **A** является **предком** класса **B**, если

- **A = B**
- **A** - прямой предок **B**
- существует такой класс **C**, что **C** - прямой предок **B** и **A** - предок **C**

Например:

```
class B(A):
    pass

class C(B):
    pass

# A -- предок С
```

Вам необходимо отвечать на запросы, является ли один класс предком другого класса

**Важное примечание**:

Создавать классы не требуется.

Мы просим вас промоделировать этот процесс, и понять существует ли путь от одного класса до другого.

**Формат входных данных**

В первой строке входных данных содержится целое число **n** - число классов.

В следующих **n** строках содержится описание наследования классов. В **i**-й строке указано от каких классов наследуется **i**-й класс. Обратите внимание, что класс может ни от кого не наследоваться. Гарантируется, что класс не наследуется сам от себя (прямо или косвенно), что класс не наследуется явно от одного класса более одного раза.

В следующей строке содержится число **q** - количество запросов.

В следующих **q** строках содержится описание запросов в формате **имя класса 1 имя класса 2**.

Имя класса – строка, состоящая из символов латинского алфавита, длины не более 50.

**Формат выходных данных**

Для каждого запроса выведите в отдельной строке слово "**Yes**", если **класс 1** является предком **класса 2**, и "**No**", если не является. 

---

** Sample Input**:

```
4
A
B : A
C : A
D : B C
4
A B
B D
C D
D A
```

**Sample Output**:

```
Yes
Yes
Yes
No
```

# Решение

```
classes = {}

def add_class(classes, class_name, parents):
    if class_name not in classes:
        classes[class_name] = []
    classes[class_name].extend(parents)
    for parent in parents:
        if parent not in classes:
            classes[parent] = []

def found_path(classes, start, end, path=[]):
    path = path + [start]
    if start == end:
        return path
    if start not in classes:
        return None
    for node in classes[start]:
        if node not in path:
            newpath = found_path(classes, node, end, path)
            if newpath: return newpath
    return None

def answer(classes, parent, child):
    if not(parent or child) in classes or not found_path(classes, child, parent):
        return 'No'
    return 'Yes'

n = int(input())
for _ in range(n):
    class_description = input().split()
    class_name = class_description[0]
    class_parents = class_description[2:]
    add_class(classes, class_name, class_parents)

q = int(input())
for _ in range(q):
    question = input().split()
    parent = question[0]
    child = question[1]
    print(answer(classes, parent, child))
```
