Восстановите строку по её коду и беспрефиксному коду символов. 

В первой строке входного файла заданы два целых числа *k* и *l* через пробел — количество различных букв, встречающихся в строке, и размер получившейся закодированной строки, соответственно. В следующих *k* строках записаны коды букв в формате "letter: code". Ни один код не является префиксом другого. Буквы могут быть перечислены в любом порядке. В качестве букв могут встречаться лишь строчные буквы латинского алфавита; каждая из этих букв встречается в строке хотя бы один раз. Наконец, в последней строке записана закодированная строка. Исходная строка и коды всех букв непусты. Заданный код таков, что закодированная строка имеет минимальный возможный размер.


В первой строке выходного файла выведите строку ss. Она должна состоять из строчных букв латинского алфавита. Гарантируется, что длина правильного ответа не превосходит 10^4 символов.

**Sample Input 1**:

```
1 1
a: 0
0
```

**Sample Output 1**:

`a`

**Sample Input 2**:

```
4 14
a: 0
b: 10
c: 110
d: 111
01001100100111
```

Sample Output 2:

`abacabad`

# Решение

```
def huffman_decode(code_table, s):
    decoded = ''
    while len(s) > 0:
        i = 0
        acc = ''
        while i < len(s):
            current_char = s[i]
            acc += current_char
            if acc in code_table.values():
                new_dict = dict(zip(code_table.values(), code_table.keys()))
                acc = new_dict[acc]
                i += 1
                break
            i += 1
        s = s[i:]
        decoded += acc
    return decoded


def main():
    letters_amount, encoded_length = map(int, input().split())
    code_table = {}
    for _ in range(letters_amount):
        letter, code = input().split(': ')
        code_table[letter] = code
    s = input()
    print(huffman_decode(code_table, s))


if __name__ == "__main__":
    main()
```
